{"config": [{"config": {"use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "batch_input_shape": [null, 1, 28, 28], "dtype": "float32", "data_format": "channels_first", "kernel_constraint": null, "filters": 30, "strides": [1, 1], "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "padding": "valid", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_first", "kernel_constraint": null, "filters": 15, "strides": [1, 1], "name": "conv2d_2", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_first", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "units": 128}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "units": 50}, "class_name": "Dense"}, {"config": {"use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "units": 10}, "class_name": "Dense"}], "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential"}